app/views/bookings/_form.html.erb

    <%= f.label :instructor_id, 'Instruktor' %>
    <%= f.collection_select :instructor_id, Instructor.all, :id, :name, {:prompt => "Zvolte instruktora"}  %>
---
SELECT  "instructors".* FROM "instructors" ORDER BY "instructors"."id" ASC LIMIT ?  [["LIMIT", 1]]