app/views/bookings/index.html.erb

SELECT "bookings".* FROM "bookings" WHERE "bookings"."user_id" = ?  [["user_id", 7]]
SELECT  "instructors".* FROM "instructors" WHERE "instructors"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  <tbody>
    <% @user.bookings.each do |booking| %>
       <% instructor = Instructor.find(booking.instructor_id) %>