app/views/ratings/show.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."rating_id" = ?  [["rating_id", 8]]
SELECT "rcomments".* FROM "rcomments" WHERE "rcomments"."rating_id" = ?  [["rating_id", 7]]
---
  <tbody>
    <% (@rating.rcomments).each do |com|  %>