app/controllers/bookings_controller.rb

SELECT "bookings".* FROM "bookings" WHERE "bookings"."user_id" = ?  [["user_id", 7]]
---
  def index
    @user = current_user
    @user_bookings = @user.bookings
                          .where('startdate >= ?', Date.today)
                          .sort_by { |b| [b.startdate, b.starttime] }

SELECT  "instructors".* FROM "instructors" WHERE "instructors"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def new
    @user = current_user
    @instructor = Instructor.find(params[:instructor_id])

SELECT  "instructors".* FROM "instructors" WHERE "instructors"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
INSERT INTO "bookings" ("start", "user_id", "instructor_id", "body", "created_at", "updated_at", "child") VALUES (?, ?, ?, ?, ?, ?, ?)  [["start", 2017-01-16 09:00:00 UTC], ["user_id", 8], ["instructor_id", 1], ["body", "coooo"], ["created_at", 2017-01-26 16:50:50 UTC], ["updated_at", 2017-01-26 16:50:50 UTC], ["child", false]]
UPDATE "bookings" SET "instructor_id" = ?, "updated_at" = ? WHERE "bookings"."id" = ?  [["instructor_id", 1], ["updated_at", 2017-01-26 17:25:51 UTC], ["id", 44]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
---
  def create
    @user = current_user
    @instructor = Instructor.find(params[:instructor_id])
    @booking = @instructor.bookings.create(booking_params)
    @booking.user_id = @user.id
    respond_to do |format|
      if @booking.save
        if !Booking.where(instructor: @instructor,
                          startdate: @booking.startdate,
                          starttime: @booking.starttime)
                   .where.not(id: @booking.id).empty?