app/controllers/comments_controller.rb

SELECT  "ratings".* FROM "ratings" WHERE "ratings"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
  def new
    @rating = Rating.find(params[:rating_id])

SELECT  "ratings".* FROM "ratings" WHERE "ratings"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
INSERT INTO "comments" ("body", "user_id", "rating_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["body", "lndskjf"], ["user_id", 8], ["rating_id", 8], ["created_at", 2017-01-22 11:02:08 UTC], ["updated_at", 2017-01-22 11:02:08 UTC]]
UPDATE "comments" SET "user_id" = ?, "updated_at" = ? WHERE "comments"."id" = ?  [["user_id", 8], ["updated_at", 2017-01-22 16:38:13 UTC], ["id", 7]]
---
  def create
    @user = current_user
    @rating = Rating.find(params[:rating_id])
    @comment = @rating.comments.create(comment_params)
    @comment.user_id = @user.id

    respond_to do |format|
      if @comment.save