app/controllers/instructors_controller.rb

  def index
    @instructors = Instructor.all
    @user = current_user
    @ski_instructors = Instructor.where(instructor_type: 'ski')
---
SELECT "instructors".* FROM "instructors"
SELECT "instructors".* FROM "instructors" WHERE "instructors"."instructor_type" = ?  [["instructor_type", 0]]

  def ski_instructors
    @instructors = Instructor.all
    @user = current_user
    @ski_instructors = Instructor.where(instructor_type: 'ski')
---
SELECT "instructors".* FROM "instructors" WHERE "instructors"."instructor_type" = ?  [["instructor_type", 0]]

  def snb_instructors
    @instructors = Instructor.all
    @user = current_user
    @snb_instructors = Instructor.where(instructor_type: 'snowboard')
---
SELECT "instructors".* FROM "instructors" WHERE "instructors"."instructor_type" = ?  [["instructor_type", 1]]

  def show
    @instructor = Instructor.find(params[:id])
---
SELECT  "instructors".* FROM "instructors" WHERE "instructors"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]