app/controllers/ratings_controller.rb

SELECT  "ratings".* FROM "ratings" WHERE "ratings"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @rating = Rating.find(params[:id])

INSERT INTO "ratings" ("body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["body", "aaa"], ["user_id", 7], ["created_at", 2017-01-21 16:34:12 UTC], ["updated_at", 2017-01-21 16:34:12 UTC]]
---
  def create
    @user = current_user
    @rating = @user.ratings.create(rating_params)