app/controllers/rcomments_controller.rb

  def new
    @rating = Rating.find(params[:rating_id])
---
SELECT  "ratings".* FROM "ratings" WHERE "ratings"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]

  def create
    @user = current_user
    @rating = Rating.find(params[:rating_id])
    @rcomment = @rating.rcomments.create(rcomment_params)
    @rcomment.user_id = @user.id

    respond_to do |format|
      if @rcomment.save
---
SELECT  "ratings".* FROM "ratings" WHERE "ratings"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
INSERT INTO "rcomments" ("body", "rating_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["body", "uuuuuuuuuuuuuuf"], ["rating_id", 7], ["created_at", 2017-01-24 13:32:47 UTC], ["updated_at", 2017-01-24 13:32:47 UTC]]
UPDATE "rcomments" SET "user_id" = ?, "updated_at" = ? WHERE "rcomments"."id" = ?  [["user_id", 8], ["updated_at", 2017-01-24 13:32:47 UTC], ["id", 1]]