app/controllers/reservations_controller.rb

INSERT INTO "reservations" ("start", "user_id", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["start", 2017-02-11 09:00:00 UTC], ["user_id", 7], ["body", "prva rezervacia"], ["created_at", 2017-01-25 17:00:17 UTC], ["updated_at", 2017-01-25 17:00:17 UTC]]
---
  def create
    @user = current_user
    @reservation = @user.reservations.create(reservation_params)