app/controllers/skinews_controller.rb

SELECT  "skinews".* FROM "skinews" ORDER BY created_at desc LIMIT ?  [["LIMIT", 10]]
---
  def index
    @skinews = Skinew.all.order("created_at desc").limit(10)

SELECT  "skinews".* FROM "skinews" WHERE "skinews"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def set_skinews
      @skinews = Skinew.find(params[:id])